<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
 "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
 <dict>
  <key>Identifier</key>
  <string>github.fleetdm.fleetctl.pkg.recipe</string>
  <key>ParentRecipe</key>
  <string>github.fleetdm.fleetctl.download</string>
  <key>Description</key>
  <string>Creates a pkg from the fleetctl zip release so that fleetctl is installed into /opt/fleetdm/, and adds it to PATH via a post-install script using a symbolic link.</string>
  <key>MinimumVersion</key>
  <string>2.0</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>fleetctl</string>
  </dict>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Arguments</key>
      <dict>
         <key>archive_path</key>
         <string>%pathname%</string>
         <key>destination_path</key>
         <string>%RECIPE_CACHE_DIR%/unzip</string>
         <key>purge_destination</key>
         <true/>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgRootCreator</string>
      <key>Arguments</key>
      <dict>
         <key>pkgroot</key>
         <string>%RECIPE_CACHE_DIR%/pkgroot</string>
         <key>pkgdirs</key>
         <dict>
            <key>opt</key>
            <string>0755</string>
            <key>opt/fleetdm</key>
            <string>0755</string>
         </dict>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>FileFinder</string>
      <key>Arguments</key>
      <dict>
         <key>pattern</key>
         <string>%RECIPE_CACHE_DIR%/unzip/*fleetctl*</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>Copier</string>
      <key>Arguments</key>
      <dict>
         <key>source_path</key>
         <string>%found_filename%</string>
         <key>destination_path</key>
         <string>%RECIPE_CACHE_DIR%/pkgroot/opt/fleetdm/fleetctl</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgRootCreator</string>
      <key>Arguments</key>
      <dict>
         <key>pkgroot</key>
         <string>%RECIPE_CACHE_DIR%/scripts</string>
         <key>pkgdirs</key>
         <dict>
            <key>scripts</key>
            <string>0755</string>
         </dict>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>FileCreator</string>
      <key>Arguments</key>
      <dict>
         <key>file_path</key>
         <string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
         <key>file_mode</key>
         <string>0755</string>
         <key>file_content</key>
         <string>#!/bin/bash

# Make the binary executable
chmod 755 /opt/fleetdm/fleetctl

# Create a symbolic link in /usr/local/bin
mkdir -p /usr/local/bin
ln -sf /opt/fleetdm/fleetctl/fleetctl /usr/local/bin/fleetctl

exit 0
</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgCreator</string>
      <key>Arguments</key>
      <dict>
         <key>pkg_request</key>
         <dict>
             <key>pkgroot</key>
             <string>%RECIPE_CACHE_DIR%/pkgroot</string>
             <key>id</key>
             <string>com.github.fleetctl</string>
             <key>version</key>
             <string>%version%</string>
             <key>options</key>
             <string>purge_ds_store</string>
             <key>pkgname</key>
             <string>fleetctl_v%version%</string>
             <key>scripts</key>
             <string>%RECIPE_CACHE_DIR%/scripts</string>
             <key>chown</key>
             <array>
                <dict>
                   <key>path</key>
                   <string>opt</string>
                   <key>user</key>
                   <string>root</string>
                   <key>group</key>
                   <string>wheel</string>
                </dict>
                <dict>
                   <key>path</key>
                   <string>opt/fleetdm</string>
                   <key>user</key>
                   <string>root</string>
                   <key>group</key>
                   <string>wheel</string>
                </dict>
                <dict>
                   <key>path</key>
                   <string>opt/fleetdm/fleetctl</string>
                   <key>user</key>
                   <string>root</string>
                   <key>group</key>
                   <string>wheel</string>
                   <key>mode</key>
                   <string>0755</string>
                </dict>
             </array>
         </dict>
      </dict>
    </dict>
  </array>
  <key>Output</key>
  <dict>
    <key>pkg_path</key>
    <string>%RECIPE_CACHE_DIR%/fleetctl_v%version%.pkg</string>
  </dict>
 </dict>
</plist>