<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
 "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Identifier</key>
    <string>github.fleetdm.fleetctl.download</string>
    <key>Description</key>
    <string>Downloads the latest fleetctl macOS release from GitHub.</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>fleetctl</string>
      <key>github_repo</key>
      <string>fleetdm/fleet</string>
      <key>asset_regex</key>
      <string>fleetctl_v([0-9]+\.[0-9]+\.[0-9]+)_macos\.zip</string>
      <key>include_prereleases</key>
      <false/>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>GitHubReleasesInfoProvider</string>
        <key>Arguments</key>
        <dict>
          <key>github_repo</key>
          <string>%github_repo%</string>
          <key>asset_regex</key>
          <string>%asset_regex%</string>
          <key>include_prereleases</key>
          <false/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
        <key>Arguments</key>
        <dict>
          <key>version</key>
          <string>%version%</string>
          <key>index</key>
          <integer>1</integer>
          <key>split_on</key>
          <string>fleet-v</string>
        </dict>
      </dict>
    </array>
    <key>Output</key>
    <dict>
      <key>url</key>
      <string>%url%</string>
      <key>pathname</key>
      <string>%pathname%</string>
      <key>version</key>
      <string>%version%</string>
    </dict>
  </dict>
</plist>