Description: Gets the latest version of fleetctl from Github releases, and normalises the version.
Identifier: com.github.jc0b.download.fleetctl
MinimumVersion: "2.3"

Input:
  NAME: fleetctl

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: fleetdm/fleet
      asset_regex: fleetctl_v.*_macos.zip

  - Processor: com.github.jazzace.processors/TextSearcher
    Arguments:
      re_pattern: \d+\.\d{1,2}\.\d{1,2}
      text_in: "%version%"
      result_output_var_name: "version"

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version%.zip"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%"
      purge_destination: true
