<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN"
 "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
 <dict>
  <key>Identifier</key>
  <string>github.fleetdm.fleetctl.pkg.recipe</string>
  <key>ParentRecipe</key>
  <string>github.fleetdm.fleetctl.download</string>
  <key>Description</key>
  <string>Creates a pkg from the fleetctl zip release so that fleetctl is installed into /opt/fleetctl/bin, then symlinked to /usr/local/bin.</string>
  <key>MinimumVersion</key>
  <string>2.0</string>
  <key>Input</key>
  <dict>
    <key>RECIPE_CACHE_DIR</key>
    <string>/tmp/autopkg_cache</string>
    <key>pkg_path</key>
    <string>%RECIPE_CACHE_DIR%/fleetctl_v%version_override%.pkg</string>
    <key>pathname</key>
    <string>%pathname%</string>
    <key>version_override</key>
    <string>4.63.0</string>
  </dict>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>Unarchiver</string>
      <key>Arguments</key>
      <dict>
         <key>archive_path</key>
         <string>%pathname%</string>
         <key>destination_path</key>
         <string>%RECIPE_CACHE_DIR%/pkgroot</string>
         <key>NAME</key>
         <string>fleetctl</string>
         <key>flatten</key>
         <true/>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgCreator</string>
      <key>Arguments</key>
      <dict>
         <key>pkg_request</key>
         <dict>
             <key>pkgroot</key>
             <string>%RECIPE_CACHE_DIR%/pkgroot</string>
             <key>id</key>
             <string>com.github.fleetctl</string>
             <key>identifier</key>
             <string>com.github.fleetctl</string>
             <key>version</key>
             <string>%version_override%</string>
             <key>install_location</key>
             <string>/opt/fleetctl/bin</string>
             <key>pkgname</key>
             <string>fleetctl_v%version_override%</string>
             <key>scripts</key>
             <string>%RECIPE_CACHE_DIR%/pkg-scripts</string>
         </dict>
      </dict>
    </dict>
  </array>
  <key>Output</key>
  <dict>
    <key>pkg_path</key>
    <string>%RECIPE_CACHE_DIR%/fleetctl_v%version_override%.pkg</string>
  </dict>
 </dict>
</plist>
